Tekla.Structures.Geometry3d.GeometricPlane
The GeometricPlane class represents a 3d geometric plane.

Tekla.Structures.Geometry3d.GeometricPlane.Origin
The origin point of the plane.

Tekla.Structures.Geometry3d.GeometricPlane.Normal
The normal vector of the plane.

Tekla.Structures.Geometry3d.GeometricPlane.#ctor
Instantiates an XY-plane with the origin at (0,0,0).

Tekla.Structures.Geometry3d.GeometricPlane.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector)
Instantiates a plane defined by the given origin point and normal vector.
Origin: The origin point to be used.
Normal: The normal vector to be used.

Tekla.Structures.Geometry3d.GeometricPlane.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Instantiates a plane defined by the given origin, X-axis vector and Y-axis vector.
Origin: The origin to be used.
Xaxis: The X-axis to be used.
Yaxis: The Y-axis to be used.

Tekla.Structures.Geometry3d.GeometricPlane.#ctor(Tekla.Structures.Geometry3d.CoordinateSystem)
Instantiates a plane defined by the given coordinate system.
CoordSys: The coordinate system to be used.

Tekla.Structures.Geometry3d.GeometricPlane.GetNormal
Returns a normalized normal vector of the plane.
Returns: The normalized normal vector of the plane.